{
  "id": "jrco_beta/02",
  "type": "comic_page",
  "location": {
    "series": "jrco_beta",
    "page": 2,
    "previous": 1,
    "next": 3
  },
  "lang_original": "en-US",
  "langs": [
    "en-US",
    "fr-FR"
  ],
  "title": {
    "en": {
      "ascii": "alarm clock",
      "filename": "alarm_clock"
    },
    "fr": {
      "filename": "reveil",
      "text": "réveil"
    }
  },
  "description": {
    "en": {
      "ascii": "JoeRunner wakes up."
    },
    "fr": {
      "ascii": "JoeRunner se reveille."
    }
  },
  "transcript": {
    "lines": [
      {
        "h": "meta/none",
        "d": {
          "en": {
            "text": "There’s a view of the bed next to the desk now. As the alarm clock audibly beeps, a hand reaches out from a lump under the covers and smacks the alarm clock on the snooze button on its side, which causes it to slide off the desk. After it clatters, there are sounds of a car crash, a man screaming in pain (the Wilhelm scream), and a cat shrieking. An exasperated young male voice speaks."
          },
          "fr": {
            "text": "Il y a maintenant un vue de le lit à côté de la bureau. Pendant que le réveil bipe audiblement, un main atteint d’une bosse sous le linge de lit et frappé le reveil sur le bouton de répétition sur le côté, cause le réveil se glisse hors-bureau. Aprés il claque, il y a des bruits d’un accident de voiture, un homme qui crie en mal (le cri Wilhelm), et un chat qui crie. Un voix de jeune homme exaspéré parle."
          }
        }
      },
      {
        "h": "jrco_beta/joerunner",
        "d": {
          "en": {
            "ascii": "I really need to get a new snooze button."
          },
          "fr": {
            "text": "J’ai vraiment besoin d’un nouveau bouton de répétition."
          }
        }
      }
    ]
  },
  "first_published": {
    "y": 2022,
    "m": 4,
    "d": 7
  },
  "post": [
    {
      "date": {
        "y": 2022,
        "m": 4,
        "d": 7
      },
      "content": {
        "en": {
          "html": "<p>This one is laminated. [<i>sic</i>]</p><p>Obviously, I’m not much of an animator. Oh well. At least it gets the point across.</p><p>Aside from page 4, I don’t have another animated page written for at least the next thirty-or-so pages, and there probably won’t be many (or any) more until the end of <cite class=\"i\">Edulympiad</cite>. This one and page 4 are animated mostly to better get the jokes across, and since I am incredibly lazy, if I don’t need to animate them for that purpose I probably won’t.</p>"
        },
        "fr": {
          "html": "<p>Cette vidéo est aimée. [<i>sic</i>]</p><p>Clairement, je ne suis pas vraiment un animateur. Tant pis. Du moins, il fais passer le message.</p><p>Excepter page 4, je n’ai pas une autre page animée écrit depuis au moins de les troixante pages prochaines, et il n’y a pas principalement beaucoup (ou du tout) des plus avant la fin d’<cite class=\"i\">Edulympiade</cite>. Celui-ci et page 4 sont animées primarement passer les gags mieux, et parce que je suis incroyablement paresseux, si je ne dois pas les animate pour ce objectif, je ne fais pas probalement.</p>"
        }
      }
    }
  ],
  "disclaimer": [
    "olympic"
  ],
  "copyright": {
    "year": {
      "first": 2022,
      "last": 2026
    },
    "license": [
      "cc-by-4.0"
    ]
  }
}