{
  "id": "jrco_beta/06",
  "type": "comic_page",
  "location": {
    "series": "jrco_beta",
    "page": 6,
    "previous": 5,
    "next": 7
  },
  "language": "en",
  "title": {
    "en": {
      "text": "next year"
    },
    "fr": {
      "text": "l’année prochaine"
    }
  },
  "description": {
    "text": "JoeRunner isn’t ecstatic about starting middle school next year.",
    "html": "JoeRunner isn’t ecstatic about starting middle school next year."
  },
  "tooltip": {
    "text": "you can really hear that semicolon",
    "html": "you can really hear that semicolon"
  },
  "transcript": {
    "lines": [
      {
        "h": null,
        "d": "JoeRunner and Eden are in the kitchen now."
      },
      {
        "h": "JoeRunner",
        "d": "I was just finishing up the last essay of the year."
      },
      {
        "h": "Eden",
        "d": "Oh, hey, the last one?"
      },
      {
        "h": "JoeRunner",
        "d": "(<i>shrugging</i>) I mean . . . until next year, anyway."
      },
      {
        "h": "Eden",
        "d": "Ooooh, next year! Middle school!"
      },
      {
        "h": "JoeRunner",
        "d": "(<i>sulking</i>) Yeah; it’s kinda gonna stink, though."
      },
      {
        "h": "Eden",
        "d": "Well, I <em style=\"roman u\">loved</em> middle school."
      },
      {
        "h": "JoeRunner",
        "d": "Well, yeah, but T.T.’s brother totally hated it, so…"
      },
      {
        "h": "Eden",
        "d": "<i>Sigh.</i> Come get some cereal, Joseph."
      },
      {
        "h": "JoeRunner",
        "d": "Hey, you’re not objecting! I totally got you! It’s totally gonna stink!"
      },
      {
        "h": "tooltip",
        "d": "you can really hear that semicolon"
      }
    ]
  },
  "first_published": {
    "y": 2022,
    "m": 7,
    "d": 22
  },
  "post": [
    {
      "date": {
        "y": 2022,
        "m": 7,
        "d": 22
      },
      "content": {
        "html": "<p><strong>Note: The collapsed portion is mostly technical, outdated, and near entirely irrelevant. It is included for completeness, but please disregard it.</strong></p><p>Alright, lotta stuff to say on this one.</p><details><summary><p>Click to uncollapse</p></summary><p>First off, this comic has a mobile-friendly version! Similarly to the format that <cite>Webtoon</cite> uses, the mobile version is comprised of several narrower images that are easier to read on a vertical screen. If you’re using a fullscreen desktop browser window, the “desktop” version should show up by default; if you’re on mobile, the mobile version should appear instead. I’m testing it out with this one, and I’ll see how well it turns out. (You can view the mobile comic on desktop by resizing your browser window to be narrower; however, I’m still trying to figure out a way to view the desktop comic on mobile. Your best bet for now is probably to just view the original image source here <small>(link removed)</small>.)</p><p>Second, I’m renaming “episodes” to “seasons.” I know, I know, calm down. I know how attached people have gotten to episodes over the last five pages, but believe me, it’s for the greater good. I want you to know that I don’t make this dramatic change lightly, and that it has a purpose. I’m calling them seasons now because webcomic “episodes” have a different meaning in <cite class=\"i\">JoeRunner and Co.</cite> than on <cite>Webtoon</cite>, the most popular webcomic publisher (that’s right, I mentioned <cite>Webtoon</cite> <em class=\"i\">twice</em>), in addition to the fact that having both “episodes” and “chapters” at once is a bit confusing. I hope your anger has more or less subsided; I understand, however, that it will likely take a long time for you to truly forgive me.</p><p>And finally, I’ve realized that probably a lot of people are reading the comic pages that have been posted, having some fun (hopefully), then leaving. Due to this, I’m going to be leaving a couple ways to stay updated with the comic in these footers from now on.</p><p>First, you can follow my <cite>Twitter</cite>, <a rel=\"external me\" href=\"https://x.com/i/user/1352061598836264960\" type=\"text/html\">@<span data-ssml-read-as=\"characters\">gabldotink</span></a>. I don’t tweet too often, so it shouldn’t flood your timeline, and I’ll keep the latest comic pinned to my profile so you can easily get to the most recent one.</p><p>Alternatively, I have an <abbr>RSS</abbr> (Really Simple Syndication) feed! It’s located here <small>(<i>link removed</i>)</small>. If you click on the link, you’ll just see a bunch of code⁠—it’s your job to get it to do its magic through an <abbr>RSS</abbr> reader, which will keep you posted whenever I update. You can learn how to do this at my handy-dandy <abbr>RSS</abbr> info page <small>(<i>link removed</i>)</small>. Aren’t I so helpful? <small>(<i>not anymore</i>)</small></p></details><p>Thank you so much for reading <cite class=\"i\">JoeRunner and Co.</cite> This is personally my favorite page I’ve made so far, and as I continue to draw this comic, they’ll continue to get better. And I’m so glad I’m finally sharing these with such a potentially wide group of people⁠—even if I only end up updating, like, once a month.</p><p><b>—⁠ ⁠<span translate=\"no\" data-ssml-phoneme-alphabet=\"ipa\" data-ssml-phoneme-ph=\"ˈɡæbəl\">gabl</span></b></p>"
      }
    }
  ],
  "copyright": {
    "year": {
      "first": 2022,
      "last": 2025
    },
    "license": [
      "cc-by-4.0"
    ]
  }
}